/* Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль.
Створити змінну для зберігання кількості днів у місяці. Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.
Створити змінні для зберігання рівня здоров'я та енергії гравця в грі. Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.
Створити змінну для зберігання суми покупки в магазині. Застосувати знижку в розмірі 10% до цієї суми за допомогою оператора множення та вивести результат в консоль.
Створити змінну для зберігання числа з плаваючою комою. Використати метод Math.floor() для округлення числа до меншого та вивести результат в консоль.
Створити змінну для зберігання рядка, який містить числа з плаваючою комою. Використати метод parseFloat() для перетворення рядка у десяткове число та вивести результат в консоль.
Створити змінну для зберігання рядка, який містить ціле число. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль.
Створити змінну для зберігання числа. Використати метод Math.sqrt() для обчислення квадратного кореня числа та вивести результат в консоль.
Створити змінні для зберігання цілочисельного значення та рядка з числом у вигляді рядка. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль. Потім використати метод toString() для перетворення цілочисельного значення у рядок та вивести результат в консоль. */

let temperatureC = prompt("Вкажи температуру в C : ");
let temperatureF = 0;
// Convert Celsius to Fahrenheit
temperatureF = (temperatureC * 9/5) + 32;
console.log(temperatureF)
let days = 30;
let hoursInDays = days*24;
let minutesInDay = hoursInDays*60;
console.log(hoursInDays)
console.log(minutesInDay)

let health = 100;
let energy = 100;
console.log(health-50)
console.log(energy-40)
let alt = 100;
console.log(alt - (alt*0.1))


let num1 = 2.65
console.log(Math.floor(num1))
let num2 = "2.65, 3.75, 4.95"
console.log(parseFloat(num2))
let num3 = "2, 3, 4"
console.log(parseInt(num3))
let num4 = 4;
console.log(Math.sqrt(num4));
let num5 = 5;
let num6 = "5"
console.log(parseInt(num6));
console.log(toString(num5));

